{
  "name": "Moonlight",
  "year": 2016,
  "runtime": 111,
  "categories": [
    "drama"
  ],
  "release-date": "2016-10-21",
  "director": "Barry Jenkins",
  "writer": [
    "Barry Jenkins"
  ],
  "actors": [
    "Trevante Rhodes",
    "André Holland",
    "Janelle Monáe",
    "Ashton Sanders",
    "Jharrel Jerome",
    "Naomie Harris",
    "Mahershala Ali"
  ],
  "storyline": "In Liberty City, Miami, Cuban drug dealer Juan (Mahershala Ali) finds Chiron (Alex Hibbert), a withdrawn child who goes by the nickname \"Little,\" hiding from a pack of bullies in a crackhouse. Juan allows Chiron to spend the night with him and his younger girlfriend Teresa (Janelle Monáe) before returning Chiron to his mother Paula (Naomie Harris).Chiron continues to spend time with Juan, who teaches him how to swim and advises him to make his own path in life. One night, Juan encounters Paula smoking crack with one of his customers. Juan berates her for her addiction and she rebukes him for selling crack to her in the first place. She implies that she knows why Chiron gets beaten up by his peers, alluding to \"the way he walks,\" before going home and taking out her frustrations on Chiron. The next day, Chiron admits to Juan and Teresa that he hates his mother and asks what \"faggot\" means. Juan describes it as \"a word used to make gay people feel bad.\" He tells Chiron it is okay to be gay and that he should not allow others to mock him. After asking Juan whether he sold drugs to Paula, Chiron leaves as Juan hangs his head in shame. Now a teenager, Chiron (Ashton Sanders) juggles avoiding school bully Terrel (Patrick Decile) and spending time with Teresa, who has lived alone since Juan's death. Paula supports her crack addiction with prostitution and coerces Chiron into giving her the money Teresa loans him. One night, Chiron has a dream in which his friend Kevin (Jharrel Jerome) has sex with a woman in Teresa's backyard. On another night, Kevin visits Chiron at the beach near his house. While smoking a blunt, the two discuss their ambitions and the nickname Kevin gave Chiron when they were children. They proceed to kiss and Kevin masturbates Chiron. The next morning, Terrel manipulates Kevin into participating in a hazing ritual. Kevin reluctantly punches Chiron until he is unable to stand before watching as Terrel and several of his friends stomp on him. When a social worker urges him to reveal his attackers' identities, Chiron refuses, stating that reporting them will not solve anything. The following day, an enraged Chiron storms into class and violently assaults Terrel with a chair. The police arrive and arrest Chiron for assault. As the police escort Chiron out of school, he glares at Kevin. Now going by the nickname \"Black\", an adult Chiron (Trevante Rhodes) deals drugs in Atlanta and receives frequent calls from Paula, who asks him to visit her at the drug treatment center where she now lives. One day, he receives a call from Kevin (André Holland), who invites him to visit him should he decide to come to Miami. The next day, he wakes up and realizes he has had a wet dream. While visiting Paula, Chiron admits that he feels remorse for his lack of empathy towards her. She proceeds to apologize for not loving him when he needed it and tells him she loves him even if he does not love her back. Chiron then travels to Miami and reunites with Kevin, who now works at a diner. When his attempts to probe Chiron about his life result in silence, Kevin tells him that he's had a child with an ex-girlfriend and, although the relationship ended, he is fulfilled by his role as a father. Chiron proceeds to ask Kevin why he called him, to which Kevin plays a song on the jukebox that made him think of Chiron. After dinner, the two drive to Kevin's apartment. Kevin tells Chiron that he is happy despite the fact that his life didn't turn out as he had hoped, resulting in Chiron breaking down and admitting that he has not been intimate with anybody since their encounter on the beach. Kevin comforts him and they embrace. In a flashback, Little stands on a beach in the moonlight."
}
