{
  "name": "Predator ",
  "year": 1987,
  "runtime": 107,
  "categories": [
    "science fiction",
    "action film"
	],
  "release-date": "June 12, 1987",
  "director": "John McTiernan",
  "writer": "Brothers Jim and John Thomas",
  "actors": [
    "Arnold Schwarzenegger",
    "Carl Weathers",
    "Chris Sarandon",
    "Jesse Ventura",
	"Sonny Landham",
	"Richard Chaves",
	"Bill Duke"
  ],
  "storyline": "spacecraft flies near Earth and releases an object which enters the atmosphere. Some time later, in a Central American jungle, U.S. Army Special Forces Major Alan “Dutch” Schaefer and his elite military rescue team — Mac, Billy, Blain, Poncho, and Hawkins — are tasked by their commander with rescuing an official held hostage by insurgents. CIA agent Dillon, a former commando and an old friend of Dutch, is assigned to supervise the team, despite Dutch's objections.

The team discovers the wreckage of a helicopter and three skinned corpses, identified by Dutch as Green Berets he knew personally at Fort Bragg. Dutch's team reaches the insurgent camp and kill the insurgents, including a Soviet intelligence officer searching through valuable documents. Confronted by Dutch, Dillon admits the mission was a setup to retrieve intelligence from captured operatives and that the dead military unit disappeared weeks earlier in a failed rescue.

After capturing Anna, a guerrilla, the team proceeds to their extraction point, unaware that they are being tracked with thermal imaging by an unseen observer. Anna escapes and is chased by Hawkins, but they are ambushed by the creature. It spares Anna but kills Hawkins and drags his body away. Dutch organizes a manhunt, during which Blain is killed by the creature's plasma weapon. Enraged, Mac initiates a firefight in which the creature is wounded, revealing luminescent green blood. The unit regroups and realizes that something in the jungle is stalking them. Dillon believes more guerrillas are responsible, but Billy is adamant that the perpetrator is not human, an assertion that is met with skepticism. The team makes camp for the night, setting traps in all directions.

That night the traps are set off, and Mac kills a wild pig, mistaking it for the creature. In the confusion, the creature steals Blain's body and Dutch realizes that their enemy uses the trees to travel. An attempt to trap the creature fails, leaving Poncho injured. Mac and Dillon pursue the alien, but it outmaneuvers and kills them. The Predator catches up with the others, killing Billy and Poncho and wounding Dutch. Realizing the creature does not target unarmed prey because there is "no sport", Dutch sends Anna to the helicopter unarmed. The creature pursues Dutch into a river and its cloaking device malfunctions. The creature, now visible, gets within a few feet of a mud-covered Dutch. His thermal signature reduced, Dutch remains unseen by the Predator and the Predator moves on. Dutch realizes he can use mud as camouflage.

While the creature collects trophies from the bodies, Dutch crafts traps and weapons and lures the creature with a war cry and fire. Dutch disables the Predator's cloaking device and inflicts minor injuries but becomes cornered. Acknowledging Dutch as a worthy foe, the creature discards its mask and plasma weapon and engages him in hand-to-hand combat. Dutch is almost beaten, but crushes the creature under a trap's counterweight. As the creature lies dying, Dutch asks, "What the hell are you?" The alien repeats the question in garbled English before activating a self-destruct device while laughing maniacally. Dutch takes cover just before the device explodes, resulting in a mushroom cloud. He is picked up by his commander and Anna in the helicopter.}
