{
  "name": "Ferngully: The Last Rainforest",
  "year": 1992,
  "runtime": 76,
  "categories": [
    "comedy",
    "family",
    "adventure",
    "animation",
    "fairies"
  ],
  "description": "This film is set in an Australian rainforest where fairies live. One of which is, Crysta, of whom shrinks a young logger named Zak to her size. Crysta and Zak then rally the forces of nature to protect the rainforest from the loggers and the main antagonist, a pollution entity named Hexxus.",
  "release-date": "1992-02-19",
  "director": "Bill Kroyer",
  "writer": [
    "Jim Cox"
  ],
  "actors": [
    "Jonathan Ward", 
    "Samantha Mathis",
    "Tim Curry", 
    "Christian Slater",
    "Robin Williams" 
  ],
  "storyline": "Crysta is a fairy with a curious nature living in FernGully, a pristine rainforest free from human intervention. The fairies of FernGully once lived in harmony with humans, but believe them to have gone extinct after having been driven away by a dark spirit named Hexxus. Crysta is the apprentice of Magi, a motherly-figure fairy who imprisoned Hexxus in a tree. One day Crysta explores a new part of the forest and meets Batty, a bat who claims to have been experimented on by humans, giving him a cocky and unstable personality. However, fairies refuse to believe him, except for Crysta, who volunteers to investigate the situation. She sees Zak, a young lumberjack whom Crysta accidentally shrinks when she tries to save him from being crushed by a falling tree, though does not know how to restore him to normal size.The tree that Hexxus is imprisoned in is cut down by Tony and Ralph, Zak's superiors. Hexxus quickly begins to regain his powers by feeding on pollution. He manipulates the humans to drive to FernGully. In FernGully, Zak meets Pips, a fairy envious of Zak's relationship with Crysta. Zak begins to fall in love with Crysta, but hides the true reason that the humans had returned. When the signs of Hexxus's resurrection begin to manifest themselves in poisoned trees and rivers, he finally admits that humans are destroying the forest. The fairies mount an attempt to defend their homes, but knowing their fight is hopeless, Zak convinces Batty to aid him in stopping the machine before it destroys them. When Zak makes his presence known to Tony and Ralph, Hexxus takes over the machine and begins to wildly destroy the forest. Magi sacrifices herself to give the fairies a chance, and she tells Crysta to remember everything she's learned. Zak manages to stop the machine, depriving Hexxus the source of his power, but he manifests himself within the oil in the machine and begins to ignite the forest ablaze. Crysta seemingly sacrifices herself by allowing herself to be devoured by Hexxus and all seems lost, until he begins to sprout limbs and leaves like a tree. Pips and the rest of the fairies rally to the powers they have been given, which causes the seed that Crysta fed him to start growing wildly. Hexxus is imprisoned by the newly grown tree at the very border of FernGully which bursts into bloom. Crysta appears after the fight, having survived her ordeal and successfully succeeded Magi as a magical fairy. She gives Zak a seed, begging him to remember everything that has transpired and she sadly restores him to his human size. Remembering the seed in his hand, Zak promises to remember his adventure, and buries the seed in the soil before telling Tony and Ralph that things need to change as they leave the forest behind. The seed sprouts new growth for FernGully, as Crysta follows Pips with Batty behind her."
}
